SOAPUtil/bin/msg/IDAACTOP_RQ.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:leg="http://com.seagullsw.appinterface/LegasuiteCICSEngine" >
   <soapenv:Header/>
   <soapenv:Body>
      <leg:IDAACTOP>
         <IDA-TC-COMMAREA-PARAMETERS>
        <IDA-TC-COMM-HEADER>
          <IDA-TC-HR-CICS-TC>XWAA</IDA-TC-HR-CICS-TC>
          <IDA-TC-HR-BANK-NO>1</IDA-TC-HR-BANK-NO>
          <IDA-TC-HR-BRANCH-NO>43</IDA-TC-HR-BRANCH-NO>
          <IDA-TC-HR-OPER-ID>034</IDA-TC-HR-OPER-ID>
          <IDA-TC-HR-TERM-ID>XWAA</IDA-TC-HR-TERM-ID>
          <IDA-TC-HR-TRAN-DATE>120517</IDA-TC-HR-TRAN-DATE>
          <IDA-TC-HR-TRAN-TIME>15395900</IDA-TC-HR-TRAN-TIME>
          <IDA-TC-HR-APPL-ID>IDA</IDA-TC-HR-APPL-ID>
          <IDA-TC-HR-IO-CODE>00</IDA-TC-HR-IO-CODE>
          <IDA-TC-HR-MAINT-TYPE-CD> </IDA-TC-HR-MAINT-TYPE-CD>
          <IDA-TC-HR-APPL-TRN-CD>100</IDA-TC-HR-APPL-TRN-CD>
          <IDA-TC-HR-NO-OF-CARDS>1</IDA-TC-HR-NO-OF-CARDS>
          <IDA-TC-HR-RESP-CD> </IDA-TC-HR-RESP-CD>
        </IDA-TC-COMM-HEADER>
        <IDA-TC-TRANS-TABLE-1>
          <I-IDA-C000-BANK-NUMBER>1</I-IDA-C000-BANK-NUMBER>
          <I-IDA-C000-ACCOUNT-NUMBER-IDA>443545914</I-IDA-C000-ACCOUNT-NUMBER-IDA>
          <I-IDA-C000-INTERNAL-TRAN-CODE>100</I-IDA-C000-INTERNAL-TRAN-CODE>
          <I-IDA-C100-CARD-ID-1>1</I-IDA-C100-CARD-ID-1>
          <I-IDA-C100-CIF-ACCOUNT-NO>0000000000000000</I-IDA-C100-CIF-ACCOUNT-NO>
          <I-IDA-C100-ACCT-TYPE-CODE>057</I-IDA-C100-ACCT-TYPE-CODE>
          <I-IDA-C100-PROMISE-CARD> </I-IDA-C100-PROMISE-CARD>
          <I-IDA-C100-DOC-TYPE-CODE> </I-IDA-C100-DOC-TYPE-CODE>
          <I-IDA-C100-OFFICER-NO-OPN-ACCT>034</I-IDA-C100-OFFICER-NO-OPN-ACCT>
          <I-IDA-C100-ACCOUNT-SHORT-NAME> </I-IDA-C100-ACCOUNT-SHORT-NAME>
          <I-IDA-C100-ACCOUNT-ENTITY-CODE>0</I-IDA-C100-ACCOUNT-ENTITY-CODE>
          <I-IDA-C100-ELA-CLASSIFICATION>0</I-IDA-C100-ELA-CLASSIFICATION>
          <I-IDA-C100-GEOGRAPHICAL-CODE>00000</I-IDA-C100-GEOGRAPHICAL-CODE>
          <I-IDA-C100-DATE-OF-BIRTH>030879</I-IDA-C100-DATE-OF-BIRTH>
          <I-IDA-C100-INSURANCE-INDICATOR> </I-IDA-C100-INSURANCE-INDICATOR>
          <I-IDA-C100-TUTOR-ACCT-CODE> </I-IDA-C100-TUTOR-ACCT-CODE>
        </IDA-TC-TRANS-TABLE-1>
        <LEG-TC-TRANS-TABLE-2>
          <I-IDA-C100-CARD-ID-2>2</I-IDA-C100-CARD-ID-2>
          <I-IDA-C100-TUTOR-ACCT-NAME> </I-IDA-C100-TUTOR-ACCT-NAME>
          <I-IDA-C100-TUTOR-MAX-WDR-MTH> </I-IDA-C100-TUTOR-MAX-WDR-MTH>
          <I-IDA-C100-TUTOR-MAX-WDR-YR> </I-IDA-C100-TUTOR-MAX-WDR-YR>
          <I-IDA-C100-TUTOR-MAX-WDR-LFE> </I-IDA-C100-TUTOR-MAX-WDR-LFE>
          <I-IDA-C100-COURT-ID-NUMBER> </I-IDA-C100-COURT-ID-NUMBER>
          <I-IDA-C100-COURT-CASE-NUMBER> </I-IDA-C100-COURT-CASE-NUMBER>
          <I-IDA-C100-COURT-CASE-TYPE> </I-IDA-C100-COURT-CASE-TYPE>
        </LEG-TC-TRANS-TABLE-2>
      </IDA-TC-COMMAREA-PARAMETERS>
      </leg:IDAACTOP>
   </soapenv:Body>
</soapenv:Envelope>